unicode_map = {
    "a": "𝗮",
    "b": "𝗯",
    "c": "𝗰",
    "d": "𝗱",
    "e": "𝗲",
    "f": "𝗳",
    "g": "𝗴",
    "h": "𝗵",
    "i": "𝗶",
    "j": "𝗷",
    "k": "𝗸",
    "l": "𝗹",
    "m": "𝗺",
    "n": "𝗻",
    "o": "𝗼",
    "p": "𝗽",
    "q": "𝗾",
    "r": "𝗿",
    "s": "𝘀",
    "t": "𝘁",
    "u": "𝘂",
    "v": "𝘃",
    "w": "𝘄",
    "x": "𝘅",
    "y": "𝘆",
    "z": "𝘇",
    #
    "á": "𝗮́",
    "à": "𝗮̀",
    "ã": "𝗮̃",
    "ả": "𝗮̉",
    "ạ": "𝗮̣",
    #
    "ă": "𝗮̆",
    "ắ": "́̆́𝗮̆̀",
    "ằ": "𝗮̆̀",
    "ặ": "̆𝗮̣̆",
    #
    "â": "𝗮̂",
    "ầ": "a",
    "ấ": "a",
    "ẩ": "a",
    "ẫ": "a",
    "ậ": "a",
    #
    "đ": "d",
    #
    "è": "e",
    "ẻ": "e",
    "é": "e",
    "ẽ": "e",
    "ẹ": "e",
    #
    "ê": "e",
    "ề": "e",
    "ế": "e",
    "ể": "e",
    "ễ": "e",
    "ệ": "e",
    #
    "ô": "o",
    "ồ": "o",
    "ố": "o",
    "ổ": "o",
    "ỗ": "o",
    "ộ": "o",
    #
    "ơ": "o",
    "ờ": "o",
    "ớ": "o",
    "ở": "o",
    "ỡ": "o",
    "ợ": "o",
    #
    "ò": "o",
    "ó": "o",
    "õ": "o",
    "ỏ": "o",
    "ọ": "o",
    #
    "ư": "u",
    "ừ": "u",
    "ứ": "u",
    "ử": "u",
    "ữ": "u",
    "ự": "u",
    #
    "ù": "𝘂̀",
    "ú": "𝘂́",
    "ũ": "𝘂̃",
    "ụ": "𝘂̣",
    "ủ": "𝘂̉",
    #
    "í": "𝗶́",
    "ì": "𝗶̀",
    "ĩ": "̃𝗶̉",
    "ỉ": "𝗶̉",
    "ị": "𝗶̣",
    #
    "ỳ": "𝘆̀",
    "ý": "𝘆́",
    "ỵ": "𝘆̣",
    "ỷ": "𝘆̉",
    "ỹ": "𝘆̃",
    # "𝗮̆̀𝗮̣̆𝗮̆̃𝗮̆̉𝗮̂̀𝗮̂́𝗮̂̉𝗮̂̃𝗮̣̂đ𝗲̂𝗲̀𝗲̉𝗲́𝗲̃𝗲̣𝗲̂̀𝗲̂́𝗲̂̉𝗲̂̃𝗲̣̂𝗼̂𝗼̛𝗼̂̀𝗼̂́𝗼̂̉𝗼̂̃𝗼̣̂𝗼̛̀𝗼̛́𝗼̛̉𝗼̛̃𝗼̛̣𝗼̀𝗼́𝗼̃𝗼̉𝗼̣𝘂̛𝘂̛̀𝘂̛́𝘂̛̉𝘂̛̃𝘂̛̣𝘂̀𝘂́𝘂̃𝘂̣𝘂̉𝗶́𝗶̀𝗶̃𝗶̉𝗶̣𝘆̀𝘆́𝘆̣𝘆̉𝘆̃"
}


def gen_unicode(string: str) -> str:
    global unicode_map

    # lower name
    string = string.lower()
    # convert to unicode string
    string = "".join([unicode_map[x] if x in unicode_map.keys() else x for x in string])

    return string


# Use later
